** Yaml is easy, just like a normal human list

   In yaml maybe my coffee, pizza and TP look like this:

   #+BEGIN_SRC yaml :tangle test.yml
     Food:
       - 38
       - 7.33

     Gas:
       - 33

     Fun:
       - 7
       - 17.58

     Grant:
       - 150

     Lisa:

     Francey:
       - 27
   #+END_SRC

   reading in this yaml would look like an array of key/value pairs:

   #+BEGIN_SRC ruby
     [{food: 5.67}, {food: 8.90}, {household: 8.99}]
   #+END_SRC

   #+RESULTS:
   | :food=>5.67      |
   | :food=>8.9       |
   | :household=>8.99 |

   gonna test that by simply executing this ruby block heh heh.

   #+BEGIN_SRC ruby 

     require 'yaml'

     expenses = YAML.load_file('test.yml')
   #+END_SRC

   #+RESULTS:
   | Food | => | (38 7.33) | Gas | => | (33) | Fun | => | (7 17.58) | Grant | => | (150) | Lisa | =>nil | Francey | => | (27) |

   Interesting that org decided to output it as a table, but I double
   checked and in ruby you'd get the array from above.

* Prototype Data
  Income, recurring paycheck every 14 days
  #+name: net-paycheck
  #+BEGIN_SRC ruby 
check = { gross: 2083.44, tax: -385.42 }
return check.values.reduce(:+)
  #+END_SRC

  #+RESULTS: net-paycheck
  : 1698.02

  Expenses, recurring monthly

  #+BEGIN_SRC yaml :tangle monthly.yml
  healthcare: 290.00
  dental: 81.00
  house: 1400.00
  versa: 117.00
  phones: 100.00
  grant_loan: 78.60
  lisa_loan: 400.00
  car_insurance: 107.50
  #+END_SRC

  Example of expenses from envelopes recorded on Keep

  #+BEGIN_SRC yaml :tangle env_expenses.yml
  # 300
  Food:
    - 38
    - 7.33

  # $60 
  Gas:
    - 33

  Fun:
    - 7
    - 17.58

  Grant:
    - 150

  Lisa:

  Francey:
    - 27
  #+END_SRC


** Prototype Fudget

   Currently trying to set up a class that can make a new budget object you
   can add income, expenses, and envelopes to.  Ideally, all data structures
   will have counterparts to yaml, and we can read and write to yaml too.
   #+name: Proto-Fudget
   #+BEGIN_SRC ruby :tangle proto-fudget.rb
  require 'yaml'

  class Fudget
    # right now, we'll just work on a monthly basis, but perhaps a future feature
    # can be setting things for different time scales

    def initialize
      @income = [] 
      @expenses = []
      @envelopes = {}
    end
    
    def add_income(source, amount, perMonth)
      income = { name: source, amount: amount }
      perMonth.times { @income << income }
    end

    def add_expense(amount)
      @expenses << amount
    end

    def add_envelope(name)
      @envelopes[name] = []
    end

    def deduct_from_envelope(env, amt)
      @envelopes[env] << amt
    end

    def total_income
      credits = []
      @income.each { |credit| credits << credit[:amount] }
      return credits.reduce(:+)
    end

    def total_expenses
      @expenses.reduce(:+)
    end

    def net_income
      return total_income - total_expenses
    end

    def load_expenses(file)
      expenses = YAML.load_file(file)

      expenses.keys.each do |key|
        debits = expenses[key] ||= [0]
        debits.each { |debit| self.deduct_from_envelope(key, debit) }
      end
    end

    def save(path)
      budget = { income: @income, 
                 expenses: @expenses, 
                 envelopes: @envelopes
               }

      file = File.open(path , 'w') 
      file.write(YAML.dump(budget))
      file.close
    end

  end
   #+END_SRC

   #+name: proto-budget
   #+BEGIN_SRC ruby 
  require './proto-fudget.rb'

  budget = Fudget.new

  budget.add_income("paycheck", 1698.02, 2)
  budget.add_income("roomy rent", 200, 2)

  expenses = YAML.load_file('monthly.yml')
  expenses.values.map { |amount| budget.add_expense(amount) }

  envelopes = ['Food', 'Grant', 'Lisa', 'Francey', 'Gas', 'Fun', 'Gifts']
  envelopes.each { |env| budget.add_envelope(env) }

  budget.load_expenses('env_expenses.yml')

  budget.save('budget.yml')

  table = [["Total Income", "Total Expenses", "Net Income"]]

  return table << [ budget.total_income, budget.total_expenses, budget.net_income ]
   #+END_SRC

   #+RESULTS: proto-budget
   | Total Income | Total Expenses | Net Income |
   |      3796.04 |         2574.1 |    1221.94 |

